import json
import pytest
import pandas as pd

@pytest.fixture
def transactions_df():
    transactions_dict = {'Дата операции': ["31.12.2021 16:44:00", "31.12.2021 16:42:04", "31.12.2021 16:39:04", "31.12.2021 15:44:39", "30.12.2021 22:22:03"],
                   'Дата платежа': ["31.12.2021", "31.12.2021", "31.12.2021", "31.12.2021", "30.12.2021"],
                   'Номер карты': ['*7197', '*7197','*7197', '*7197', ''],
                   'Сумма операции': [-160.89, -64.00, -118.12, -78.05, -20000.00],
                   'Сумма платежа': [-160.89, -64.00, -118.12, -78.05, -20000.00],
                   'Категория': ["Супермаркеты", "Супермаркеты", "Супермаркеты", "Супермаркеты", "Переводы"],
                   'Сумма операции с округлением': [160.89, 64.00, 118.12, 78.05, 20000.00],
                   'Кэшбэк': [0, 0, 0, 0, 0]
                        }

    return pd.DataFrame(transactions_dict)

@pytest.fixture
def date_str():
    return ["01.12.2021 00:00:00", '31.12.2021 12:17:15']

